Stachu1/STM32_Watch/firmware/main.c
#include "stm32l0x1_peripherals.h"
#include "intrin.h"
#include "types.h"

#define EVER (;;)
#define SYSCLK 2097000
#define BAUD 115200
#define TS_CAL1 *((u16*) 0x1FF8007A)
#define TS_CAL2 *((u16*) 0x1FF8007E)
#define VREFINT_CAL *((u16*) 0x1FF80078)
#define FIXED_SHIFT 16
#define FIXED_ONE (1 << FIXED_SHIFT)
#define IMU_ADDR 0x6A               // I2C address of the LSM6DSM IMU (SA0 pulled low)
#define MAX_BRIGHTNESS_LEVEL 6      // 1 << MAX_BRIGHTNESS_LEVEL = BRIGHTNESS_STEPS
#define MIN_BRIGHTNESS_LEVEL 3      // Lowest brightness level (too low causes flickering and instability in the effect)
#define BRIGHTNESS_STEPS (1 << MAX_BRIGHTNESS_LEVEL) // Number of steps in the brightness control (Impacts frame rate)
#define STATS_FRAME_TIME 50         // ms between each frame in the stats animation
#define SIM_DT 8                    // ms between each physics update in pendulum sim mode
#define SIM_FRICTION 160            // Friction applied to pendulums in pendulum sim mode (Q32)
#define SIM_AFTER_TAP_SPEED 327680  // Speed the pendulum is set to on double tap in pendulum sim mode (Q32)
#define SIM_INACTIVITY_THS 5500     // min speed before entering Stop Mode (Q32)1 = 2*Pi/s
#define INACTIVITY_TIMEOUT 5000     // ms of inactivity before entering Stop Mode
#define STATS_TIMEOUT 10000         // ms before switching entering Stope Mode from stats mode due to inactivity
#define DEBUG false                 // Set to true to enable debug prints over UART
#define USE_IMU true                // Set to false to disable IMU for ULP mode or if IMU is not mounted


typedef i32 q32;

typedef struct {
    u8 new_position;        // New position to set the hand to (1->12 0 for off)
    u8 position;            // position of the hand (1-12 0 for off)
    u8 brightness;          // Brightness of the hand (0-(BRIGHTNESS_STEPS-1))
    u8 tick;                // Tick counter for breathing effect
    u8 tick_div;            // Tick divider for breathing speed control
    b8 fading_in;           // Whether the hand is currently fading in or out
} Hand;

typedef struct {
    volatile u32* port;     // Pointer to GPIO port
    u8 pin;                 // Pin number for the LED
} LED;

typedef struct {
    b8 pressed;             // Button was pressed flag (set after release if press was valid)
    b8 down;                // Button is currently held down
    u32 state_history;      // BUtton state history for debouncing (1 bit per sample, 0 for pressed)
    u32 ignore_until;       // Millis until presses are ignored (used on wakeup and IMU toggle)
} BTN;

Hand hands[3] = {
    {0, 0, 0, 0, 0, true},  // Hour hand is static
    {0, 0, 0, 0, 5, true},  // Minute hand oscillates with tick_div of 5
    {0, 0, 0, 0, 1, true}   // Second hand oscillates with tick_div of 1
};

const volatile LED leds[] = {
    {(volatile u32*)GPIOB, 5},   // LED 1: PB5
    {(volatile u32*)GPIOB, 3},   // LED 2: PB3
    {(volatile u32*)GPIOA, 12},  // LED 3: PA12
    {(volatile u32*)GPIOB, 2},   // LED 4: PB2
    {(volatile u32*)GPIOA, 7},   // LED 5: PA7
    {(volatile u32*)GPIOA, 6},   // LED 6: PA6
    {(volatile u32*)GPIOA, 5},   // LED 7: PA5
    {(volatile u32*)GPIOA, 4},   // LED 8: PA4
    {(volatile u32*)GPIOA, 1},   // LED 9: PA1
    {(volatile u32*)GPIOB, 8},   // LED 10: PB8
    {(volatile u32*)GPIOB, 7},   // LED 11: PB7
    {(volatile u32*)GPIOB, 6}    // LED 12: PB6
};

// Sine LUT with 64 entries for 0-360 degrees (scaled to Q32)
const q32 SIN_LUT[64] = {
    0, 6423, 12785, 19024, 25079, 30893, 36409, 41575,
    46340, 50660, 54491, 57800, 60564, 62755, 64348, 65323,
    65636, 65323, 64348, 62755, 60564, 57800, 54491, 50660,
    46340, 41575, 36409, 30893, 25079, 19024, 12785, 6423,
    0, -6423, -12785, -19024, -25079, -30893, -36409, -41575,
    -46340, -50660, -54491, -57800, -60564, -62755, -64348, -65323,
    -65636, -65323, -64348, -62755, -60564, -57800, -54491, -50660,
    -46340, -41575, -36409, -30893, -25079, -19024, -12785, -6423
};

const u8 hex_table[16] = {'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F'};
BTN btn_up = {false, false, 0xFFFFFFFF, 0}, btn_down = {false, false, 0xFFFFFFFF, 0};
volatile u32 pwm_step = BRIGHTNESS_STEPS * 3;
volatile u8 sub_millis = 0;
u32 millis = 0;
u32 last_activity = 0;
u8 brightness_level = MAX_BRIGHTNESS_LEVEL;
b8 IMU_Enabled = USE_IMU;
b8 sim_double_tap = false;

enum Mode {
    MODE_TIME,
    MODE_VOLTAGE,
    MODE_TEMPERATURE,
    MODE_TIME_SETTING,
    MODE_PENDULUM_SIM
} current_mode;


void Spin(u32);
void Delay_us(u32);
void Delay_ms(u32);
void GPIO_Init(void);
void Button_State_Handler(void);
void Hands_Update_Handler(void);
void TIM21_Init(void);
void Hand_Set(u8, u8);
void UART_Init(void);
void UART_Deinit(void);
void Print_char(u8);
void Print_str(c*);
void Print_u32(u32);
void Print_i32(i32);
void Print_q32(q32);
u8 Ambient_Sense(void);
void ADC_Init(void);
void ADC_Deinit(void);
u32 ADC_Get_VDDA(void);
i32 ADC_Get_Temp(void);
void I2C_Init(void);
void I2C_Deinit(void);
void I2C_Write(u8, u8, u8*, u8);
void I2C_Read(u8, u8, u8*, u8);
void IMU_Init(void);
void IMU_Deinit(void);
void IMU_Get_Accel(i16*, i16*, i16*);
i32 IMU_Get_Temp(void);
void RTC_Init(void);
void RTC_Set_Time(u8, u8, u8);
void RTC_Get_Time(u8*, u8*, u8*);
void RTC_Wakeup_Init(void);
void RTC_Set_Hands(void);
void Mode_Handler(void);
void Mode_Voltage_Handler(b8);
void Mode_Temperature_Handler(b8);
void Mode_Time_Setting_Handler(b8);
void Mode_Pendulum_Sim_Handler(b8);
void Enter_Stop_Mode(void);
void Wakeup_Handler(void);


void main(void)
{
    GPIO_Init();
    TIM21_Init();
    UART_Init();
    ADC_Init();
    RTC_Init();
    RTC_Wakeup_Init();
    if (IMU_Enabled)
    {
        I2C_Init();
        IMU_Init();
    }

    RTC_Set_Time(10, 15, 30);
    RTC_Set_Hands();

    for EVER
    {
        Mode_Handler();

        if ((current_mode != MODE_VOLTAGE && current_mode != MODE_TEMPERATURE &&
            millis - last_activity > INACTIVITY_TIMEOUT) || (millis - last_activity > STATS_TIMEOUT))
        {
            Enter_Stop_Mode();
            Wakeup_Handler();
        }
    }
}

// ====== ISR ======

// TIM21 Interrupt Handler for SW PWM control of LEDs an Button state handling
// (3% CPU | 3us @ 32MHz ~ 96 cycles)
void TIM21_IRQ_Handler(void)
{
    // Clear flag
    TIM21->SR &= ~TIM21_SR_UIF;

    // Update millis
    sub_millis++;
    if (sub_millis == 10) // ~10 kHz / 10 ~= 1 kHz for millis update
    {
        sub_millis = 0;
        millis++;

