Stachu1/STM32_Watch/firmware/main.c
    // Restart and Read
    I2C1->CR2 = (addr << 1) | I2C1_CR2_RD_WRN | (size << 16) | I2C1_CR2_START | I2C1_CR2_AUTOEND;
    
    for (int i = 0; i < size; i++)
    {
        while (!(I2C1->ISR & I2C1_ISR_RXNE)) Spin(1);
        buf[i] = I2C1->RXDR;
    }

    while (!(I2C1->ISR & I2C1_ISR_STOPF)) Spin(1);
    I2C1->ICR |= I2C1_ICR_STOPCF;
}

// Init the LSM6DSM IMU
void IMU_Init(void)
{
    // === Set Accel to 416Hz, +/- 4g, high performance diabled ===
    // CTRL1_XL register (ODR_XL) (FS_XL)
    u8 buf = (0x6 << 4) | (0x2 << 2);
    I2C_Write(IMU_ADDR, 0x10, &buf, 1);
    // CTRL6_C register (XL_HM_MODE)
    buf = (0x1 << 4);
    I2C_Write(IMU_ADDR, 0x15, &buf, 1);

    // === Enables double tap detection ===
    // TAP_CFG register (INTERRUPTS_ENABLE) (TAP_Z_EN)
    buf = (0x1 << 7) | (0x1 << 1);
    I2C_Write(IMU_ADDR, 0x58, &buf, 1);

    // TAP_THS_6D register (TAP_THS)
    buf = 0x5;
    I2C_Write(IMU_ADDR, 0x59, &buf, 1);
    // INT_DUR2 register (DUR3:0) (QUIET1:0) (SHOCK1:0)
    buf = (0x5 << 4) | (0x5 << 2) | (0x3);
    I2C_Write(IMU_ADDR, 0x5A, &buf, 1);
    // WAKE_UP_THS register (SINGLE_DOUBLE_TAP)
    buf = (0x1 << 7);
    I2C_Write(IMU_ADDR, 0x5B, &buf, 1);

    // === Enable absolute wrist tilt detection == 
    // CTRL10_C register (WRIST_TILT_EN) (FUNC_EN)
    buf = (0x1 << 7) | (0x1 << 2);
    I2C_Write(IMU_ADDR, 0x19, &buf, 1);
    // FUNC_CFG_ACCESS (FUNC_CFG_EN) ( FUNC_CFG_EN_B)
    buf = (0x1 << 7) | (0x1 << 5);
    I2C_Write(IMU_ADDR, 0x01, &buf, 1);

    // A_WRIST_TILT_THS Absolute Wrist Tilt threshold register 1 LSB = 15.625 mg
    buf = 0x32;
    I2C_Write(IMU_ADDR, 0x58, &buf, 1);
    // A_WRIST_TILT_Mask register (Xneg) (Zpos)
    buf = (0x1 << 3);
    I2C_Write(IMU_ADDR, 0x59, &buf, 1);
    // Disable embedded functions register
    buf = 0x0;
    I2C_Write(IMU_ADDR, 0x01, &buf, 1);

    // === Interrupt routing ===
    // MD1_CFG register (INT1_DOUBLE_TAP)
    buf = (0x1 << 3);
    I2C_Write(IMU_ADDR, 0x5E, &buf, 1);
    // DRDY_PULSE_CFG register (INT2_WRIST_TILT)
    buf = 0x1;
    I2C_Write(IMU_ADDR, 0x0B, &buf, 1);
}

// Deinit the IMU
void IMU_Deinit(void)
{
    // Power down the Gyro & Accel
    // Register 0x11 (CTRL2_G) = 0x00
    u8 buf[] = {0x0, 0x0};
    I2C_Write(IMU_ADDR, 0x10, buf, 2);

    // Clear the Interrupt masks
    I2C_Write(IMU_ADDR, 0x5E, buf, 1);
    I2C_Write(IMU_ADDR, 0x0B, buf, 1);
}

// Read acceleration from the IMU
void IMU_Get_Accel(i16 *x, i16 *y, i16 *z)
{
    u8 buf[6];
    I2C_Read(IMU_ADDR, 0x28, buf, 6);
    *x = (i16)((buf[1] << 8) | buf[0]);
    *y = (i16)((buf[3] << 8) | buf[2]);
    *z = (i16)((buf[5] << 8) | buf[4]);
}

// Read temperature from the IMU in m°C
i32 IMU_Get_Temp(void)
{
    u8 buf[2];
    I2C_Read(IMU_ADDR, 0x1E, buf, 1);
    if ((buf[0] & (1 << 2)) == 0) return 0; // Temp data not ready
    I2C_Read(IMU_ADDR, 0x20, buf, 2);

    // Convert raw value to m°C
    // 256 LSB/°C val=0 @25°C =>  m°C = °C*1000 + ((°C/256) * 39 + 5) / 10 + 25000
    return (i32)buf[1] * 1000 + (buf[0] * 39 + 5) / 10 + 25000;
}


// Init RTC for hand updates every second
void RTC_Init(void)
{
    // Disable backup domain write protection
    PWR->CR |= PWR_CR_DBP;

    // Start LSE and wait until ready
    if (!(RCC->CSR & RCC_CSR_LSERDY))
    {
        RCC->CSR |= RCC_CSR_LSEON;
        while (!(RCC->CSR & RCC_CSR_LSERDY)) Spin(10);
    }

    // Set LSE as RTC clock source
    BF_SET(RCC->CSR, RCC_CSR_RTCSEL, 0x1);

    // Enable RTC
    RCC->CSR |= RCC_CSR_RTCEN;
}

// Set RTC time (12h format, hours max 12)
void RTC_Set_Time(u8 hours, u8 minutes, u8 seconds)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Disable write protection
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    // Enter initialization mode
    RTC->ISR |= RTC_ISR_INIT;
    while (!(RTC->ISR & RTC_ISR_INITF)) Spin(10);

    // Set RTC prescaler for 1Hz time base (LSE is 32.768 kHz)
    BF_SET(RTC->PRER, RTC_PRER_PREDIV_A, 0x7F);
    BF_SET(RTC->PRER, RTC_PRER_PREDIV_S, 0xFF);

    // Set 12h format
    RTC->CR |= RTC_CR_FMT;

    // Set time in BCD format
    u32 temp_tr = 0;
    temp_tr |= ((hours / 10) << RTC_TR_HT_LSB) | ((hours % 10) << RTC_TR_HU_LSB);
    temp_tr |= ((minutes / 10) << RTC_TR_MNT_LSB) | ((minutes % 10) << RTC_TR_MNU_LSB);
    temp_tr |= ((seconds / 10) << RTC_TR_ST_LSB) | (seconds % 10);
    RTC->TR = temp_tr;

    // Exit initialization mode
    RTC->ISR &= ~RTC_ISR_INIT;

    // Wait for synchronization
    RTC->ISR &= ~RTC_ISR_RSF; 
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Enable write protection
    RTC->WPR = 0xFF;
}

// Get RTC time
void RTC_Get_Time(u8 *hours, u8 *minutes, u8 *seconds)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Read time
    u32 tr = RTC->TR;
    *hours = ((tr & RTC_TR_HT_MASK) >> RTC_TR_HT_LSB) * 10 + ((tr & RTC_TR_HU_MASK) >> RTC_TR_HU_LSB);
    *minutes = ((tr & RTC_TR_MNT_MASK) >> RTC_TR_MNT_LSB) * 10 + ((tr & RTC_TR_MNU_MASK) >> RTC_TR_MNU_LSB);
    *seconds = ((tr & RTC_TR_ST_MASK) >> RTC_TR_ST_LSB) * 10 + ((tr & RTC_TR_SU_MASK) >> RTC_TR_SU_LSB);
}

// Enable RTC 0.2Hz interrupt for hand updates
void RTC_Wakeup_Init(void)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Disable Write Protection
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    // Disable Wakeup Timer to configure it
    RTC->CR &= ~RTC_CR_WUTE;

    // Wait for access allowed
    while (!(RTC->ISR & RTC_ISR_WUTWF)) Spin(10);

    // Configure Clock Source for 1Hz
    // WUCKSEL = 0b100 selects the 1Hz clock (RTCCLK div by prescalers)
    RTC->CR &= ~(RTC_CR_WUCKSEL_MASK << RTC_CR_WUCKSEL_LSB);
    RTC->CR |= (0x4 << RTC_CR_WUCKSEL_LSB);

    // Clear Wakeup Timer flag and EXTI pending bit
    RTC->ISR &= ~RTC_ISR_WUTF;
    EXTI->PR = EXTI_PR_PIF20;

    // For 0.2Hz clock, WUTR = 4 means 5 second interval (Interval = WUTR + 1)
    RTC->WUTR = 4;

