Stachu1/STM32_Watch/firmware/main.c
    // Enable Interrupt and Timer
    RTC->CR |= RTC_CR_WUTIE | RTC_CR_WUTE;

    // Enable Write Protection
    RTC->WPR = 0xFF;

    // RTC Wakeup is connected to EXTI Line 20
    EXTI->IMR |= EXTI_IMR_IM20;    // Interrupt Mask: Enable line 20
    EXTI->RTSR |= EXTI_RTSR_RT20;   // Rising Trigger: Enable

    // Enable RTC global interrupt in NVIC
    NVIC->ISER |= (1 << 2);
}

// Update hand new_positions based on current RTC time
void RTC_Set_Hands(void)
{
    u8 h, m, s;
    RTC_Get_Time(&h, &m, &s);

    // Set hand new_positions based on current time
    Hand_Set(0, h);
    Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
    Hand_Set(2, (s / 5 == 0) ? 12 : (s / 5));
}

// ====== Mode Handlers ======

// Handle mode changes and mode-specific logic
void Mode_Handler(void)
{
    switch (current_mode)
    {
        case MODE_TIME:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Changing brightness\n");
                brightness_level = (brightness_level == MAX_BRIGHTNESS_LEVEL) ? MIN_BRIGHTNESS_LEVEL : brightness_level + 1;
                RTC_Set_Hands();
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode voltage\n");
                current_mode = MODE_VOLTAGE;
                Mode_Voltage_Handler(true);
            }
            break;
        case MODE_VOLTAGE:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Mode temperature\n");
                current_mode = MODE_TEMPERATURE;
                Mode_Temperature_Handler(true);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time setting entry\n");
                current_mode = MODE_TIME_SETTING;
                Mode_Time_Setting_Handler(true);
            }
            Mode_Voltage_Handler(false);
            break;
        case MODE_TEMPERATURE:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Mode voltage\n");
                current_mode = MODE_VOLTAGE;
                Mode_Voltage_Handler(true);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time setting entry\n");
                current_mode = MODE_TIME_SETTING;
                Mode_Time_Setting_Handler(true);
            }
            Mode_Temperature_Handler(false);
            break;
        case MODE_TIME_SETTING:
            Mode_Time_Setting_Handler(false);
            break;
        case MODE_PENDULUM_SIM:
            if (btn_down.down && btn_up.down)
            {
                if (IMU_Enabled)
                {
                    Print_str("Disabling IMU\n");
                    IMU_Deinit();
                    I2C_Deinit();
                    IMU_Enabled = false;
                }
                else
                {
                    Print_str("Enabling IMU\n");
                    I2C_Init();
                    IMU_Init();
                    IMU_Enabled = true;
                }
                Print_str("Mode time\n");
                current_mode = MODE_TIME;
                RTC_Set_Hands();
                btn_down.ignore_until = millis + 300;
                btn_up.ignore_until = millis + 300;                
            }
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Changing brightness\n");
                brightness_level = (brightness_level == MAX_BRIGHTNESS_LEVEL) ? MIN_BRIGHTNESS_LEVEL : brightness_level + 1;
                Hand_Set(0, hands[0].position);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time\n");
                current_mode = MODE_TIME;
                RTC_Set_Hands();
            }
            Mode_Pendulum_Sim_Handler(false);
            break;
    }
}

// Voltage mode: map battery voltage to hand position
void Mode_Voltage_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_idx = 0;
    static b8 done = false;

    if (reset)
    {
        last_update = 0;
        done = false;
        u32 vdda_mV = ADC_Get_VDDA();
        Print_str("Battery Voltage: ");
        Print_u32(vdda_mV);
        Print_str(" mV\n");

        // Map 2.0V-3.2V to 0-12 hand index (100mV per step)
        hand_idx = ((vdda_mV - 2000) / 100);
        if (hand_idx > 12) hand_idx = 12;
        Hand_Set(0, 12);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    if (done) return;

    // Wait for hands position to be pulled from new_position
    if (hands[0].new_position != 255) return;

    // Update hand positions gradually for smooth animation
    if (millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        u8 new_pos = (hands[0].position == 12) ? 1 : hands[0].position + 1;
        Hand_Set(0, new_pos);
        if (new_pos >= hand_idx) done = true;
    }
}

// Temperature mode: map IMU temperature to hand position
void Mode_Temperature_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_h_idx = 0;
    static u8 hand_m_idx = 0;
    static b8 done = false;

    if (reset)
    {
        last_update = 0;
        done = false;
        u32 temp_mC = IMU_Enabled ? IMU_Get_Temp() : ADC_Get_Temp();
        Print_str("Temperature: ");
        Print_u32(temp_mC);
        Print_str(" mC\n");

        // Map 0°C-60°C to 0-12 hand_h index (5°C per step)
        // and 0.5°C per step for hand_m index
        hand_h_idx = temp_mC / 5000;
        hand_m_idx = (temp_mC - hand_h_idx * 5000) / 500;
        if (hand_h_idx > 12) hand_h_idx = 12;
        if (hand_m_idx > 12) hand_m_idx = 12;
        Hand_Set(0, 12);
        Hand_Set(1, 12);
        Hand_Set(2, 0);
        return;
    }

    if (done) return;

    // Wait for hands position to be pulled from new_position
    if (hands[0].new_position != 255) return;

    // Update hand positions gradually for smooth animation
    if (millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        if (hands[0].position != hand_h_idx)
        {
            u8 new_pos = (hands[0].position == 12) ? 1 : hands[0].position + 1;
            Hand_Set(0, new_pos);
        }

