Stachu1/STM32_Watch/firmware/main.c
        if (hands[1].position != hand_m_idx)
        {
            u8 new_pos = (hands[1].position == 12) ? 1 : hands[1].position + 1;
            Hand_Set(1, new_pos);
        }
        if (hands[0].position == hand_h_idx && hands[1].position == hand_m_idx) done = true;
    }
}


void Mode_Time_Setting_Handler(b8 reset)
{
    static u32 last_update = 0;
    static enum {
        ENTRY,
        SET_HOURS,
        SET_MINUTES,
    } stage;
    static u8 h = 0, m = 0;

    if (reset)
    {
        // On entry, read RTC and round min down to nearest 5
        stage = ENTRY;
        Hand_Set(0, 0);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    switch (stage)
    {
    case ENTRY:
        if (millis - last_update >= STATS_FRAME_TIME / 2)
        {
            last_update = millis;
            Hand_Set(0, (hands[0].position == 12) ? 1 : hands[0].position + 1);
        }
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_HOURS;
            Print_str("Setting Hours\n");
            h = 12;
            Hand_Set(0, h);
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            if (USE_IMU)
            {
                current_mode = MODE_PENDULUM_SIM;
                Mode_Pendulum_Sim_Handler(true);
            }
            else
            {
                current_mode = MODE_TIME;
                RTC_Set_Hands();
            }
        }
        break;
    case SET_HOURS:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_MINUTES;
            Print_str("Setting Minutes\n");
            Hand_Set(0, h);
            m = 60;
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            h = (h == 12) ? 1 : h + 1;
            Hand_Set(0, h);
        }
        break;
    case SET_MINUTES:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            current_mode = MODE_TIME;
            RTC_Set_Time(h, m, 0);

            // Set hand new_positions based on current time
            Hand_Set(0, h);
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
            Hand_Set(2, 12);
            Print_str("Time Set\n");
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            m = (m > 55) ? 5 : m + 5;
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
        }
        break;
    }
}

// Pendulum sim mode: display a simple pendulum simulation
void Mode_Pendulum_Sim_Handler(b8 reset)
{
    static u32 last_update = 0;
    static q32 alpha = 0;
    static q32 omega = 0;

    if (reset)
    {
        alpha = 0;
        omega = 0;
        sim_double_tap = false;
        Hand_Set(0, 0);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    // Let the user know that IMU is disabled
    if (!IMU_Enabled)
    {
        if (millis - last_update >= 3*STATS_FRAME_TIME)
        {
            last_update = millis;
            Hand_Set(0, hands[0].position == 3 ? 9 : 3);
        }
        return;
    }

    // Update simulation
    if (millis - last_update >= SIM_DT)
    {
        last_update = millis;

        // Get raw accel data from IMU
        i16 raw_x, raw_y, raw_z;
        IMU_Get_Accel(&raw_x, &raw_y, &raw_z);

        // Convert raw accel (+/- 4g) to q32
        q32 accel_x = (q32)raw_x << 3;
        q32 accel_y = (q32)raw_y << 3;

        // Scale down angle to fit 64 sin table
        u8 table_idx = (alpha >> (FIXED_SHIFT - 6))  & 63;
        q32 sin_v = SIN_LUT[table_idx];
        q32 cos_v = SIN_LUT[(table_idx + 16) & 63];

        // Rotate accel vector by alpha to align with hand and apply as acceleration to omega
        q32 accel_aligned = -(accel_x >> (FIXED_SHIFT / 2)) * (sin_v >> (FIXED_SHIFT / 2));
        accel_aligned -= (accel_y >> (FIXED_SHIFT / 2)) * (cos_v >> (FIXED_SHIFT / 2));

        // Integrate accel to get angular velocity
        // Multiply by dt and 1/(2*Pi*r) ~= 11
        // Divide by 1000 to convert ms to s
        omega += (accel_aligned * SIM_DT * 11) >> 10;

        // Multiply by friction factor (0.98) to prevent runaway and add damping
        omega -= (omega * SIM_FRICTION) >> FIXED_SHIFT;

        if (sim_double_tap)
        {
            sim_double_tap = false;
            omega += (omega > 0) ? SIM_AFTER_TAP_SPEED : -SIM_AFTER_TAP_SPEED;
        }

        // Integrate omega to get angle
        // Multiply by dt and divide by 1000 to convert ms to s
        alpha += (omega * SIM_DT) >> 10;

        // Add 1/12/2 for proper rounding
        u32 hand_pos = alpha + FIXED_ONE / 24;

        // Map to 0-255
        hand_pos = (hand_pos >> (FIXED_SHIFT - 8)) & 0xFF;

        // Mpa to 1-12 hand index (avoiding division)
        hand_pos = ((hand_pos * 3) >> 6);
        Hand_Set(0, (hand_pos == 0) ? 12 : hand_pos);

        if (omega > SIM_INACTIVITY_THS || -omega > SIM_INACTIVITY_THS)
        {
            last_activity = millis;
        }
    }
}

// ====== Power Management =====

// Enter Stop Mode for deep sleep with low power consumption
void Enter_Stop_Mode(void)
{
    // Disable RTC wakeup timer
    EXTI->IMR &= ~EXTI_IMR_IM20;

    // Deinit UART & ADC
    UART_Deinit();
    ADC_Deinit();

    if (IMU_Enabled)
    {
        // Set IMU to 26Hz
        u8 buf = (0x2 << 4) | (0x2 << 2);
        I2C_Write(IMU_ADDR, 0x10, &buf, 1);
    }

    // Reset Hands
    Hand_Set(0, 0);
    Hand_Set(1, 0);
    Hand_Set(2, 0);
    while (hands[0].new_position != 255) Spin(1);

    // Make sure all LED pins are low
    GPIOA->BSRR = 0b1000011110010 << 16;
    GPIOB->BSRR = 0b111101100 << 16;

    // Ensure all I2C transmissions are complete
    while (I2C1->ISR & I2C1_ISR_BUSY);
    I2C1->ICR |= I2C1_ICR_STOPCF;

    TIM21->CR1 &= ~TIM21_CR1_CEN;
    RCC->APB2ENR &= ~RCC_APB2ENR_TIM21EN;

    // PWR Control: LPSDSR (Low-power regulator) + Clear PDDS (Stop Mode)
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR |= PWR_CR_LPSDSR;
    PWR->CR &= ~PWR_CR_PDDS;

    // Set SLEEPDEEP bit in System Control Register
    SCB->SCR |= SCB_SCR_SLEEPDEEP;

    // Clear Wakeup Flag
    PWR->CR |= PWR_CR_CWUF;

    // Wait For Interrupt
    __asm volatile ("wfi");
}

// Restore clock settings after waking up from Stop Mode
void Wakeup_Handler(void)
{
    // Enable PWR clock
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;

    // Set voltage regulator to 1.2V (Range 3)
    while (PWR->CSR & PWR_CSR_VOSF) __asm__ volatile ("nop");
    BF_SET(PWR->CR, PWR_CR_VOS, 0x3); 
    while (PWR->CSR & PWR_CSR_VOSF) __asm__ volatile ("nop");

    // Enable clocks for peripherals
    RCC->APB2ENR |= RCC_APB2ENR_TIM21EN;
    TIM21->CR1 |= TIM21_CR1_CEN;
    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;

    // Reinit peripherals
    GPIO_Init();
    UART_Init();
    ADC_Init();

    // Reset variables
    millis = 0;
    last_activity = 0;
    current_mode = MODE_TIME;
    btn_down.ignore_until = 300;
    btn_up.ignore_until = 300;

    // Re-enable RTC wakeup interrupt and update hands to current time
    EXTI->IMR |= EXTI_IMR_IM20;
    RTC_Set_Hands();

    if (IMU_Enabled)
    {
        // Set IMU back to 416Hz, +/- 4g
        u8 buf = (0x6 << 4) | (0x2 << 2);
        I2C_Write(IMU_ADDR, 0x10, &buf, 1);
    }
}
